{
  "<pad>": 0,
  "UNK": 1,
  "child_file_name:handler.go": 71,
  "child_resource_type:Handler": 37,
  "directory:jill": 28,
  "directory:jim": 68,
  "directory:jim,": 70,
  "folder_name:jill": 27,
  "grandparent_resource_name:API": 64,
  "grandparent_resource_name:AdminPortal": 59,
  "grandparent_resource_name:bar": 44,
  "grandparent_resource_name:jill": 49,
  "grandparent_resource_name:my_server": 54,
  "grandparent_resource_type:Webserver,": 43,
  "intent:BACKUP,": 8,
  "intent:CLONE,": 33,
  "intent:COMMIT,": 29,
  "intent:CREATE,": 2,
  "intent:DEBUG,": 20,
  "intent:DELETE,": 4,
  "intent:DEPLOY,": 14,
  "intent:MERGE,": 34,
  "intent:PULL,": 32,
  "intent:PUSH,": 31,
  "intent:READ,": 11,
  "intent:REFACTOR,": 6,
  "intent:RESTART,": 19,
  "intent:RESTORE,": 9,
  "intent:START,": 16,
  "intent:STOP,": 18,
  "intent:UPDATE,": 5,
  "parent_resource_name:Blog": 61,
  "parent_resource_name:Users,": 58,
  "parent_resource_name:baz,": 42,
  "parent_resource_name:jack,": 48,
  "parent_resource_name:main": 56,
  "parent_resource_name:my_handler": 46,
  "parent_resource_name:my_handler,": 53,
  "parent_resource_name:qux": 51,
  "parent_resource_name:v1,": 63,
  "parent_resource_type:Handler": 39,
  "parent_resource_type:Handler,": 41,
  "resource_name:Person,": 55,
  "resource_name:Post,": 60,
  "resource_name:User,": 62,
  "resource_name:UserProfile,": 57,
  "resource_name:bar.log": 25,
  "resource_name:data_structure": 13,
  "resource_name:foo,": 40,
  "resource_name:foo.txt": 24,
  "resource_name:handler,": 67,
  "resource_name:handler.go,": 69,
  "resource_name:jack,": 26,
  "resource_name:jim": 65,
  "resource_name:jim,": 47,
  "resource_name:my_model,": 50,
  "resource_name:my_struct,": 45,
  "resource_name:my_variable,": 52,
  "resource_name:webserver,": 36,
  "resource_type:Application": 15,
  "resource_type:Code,": 12,
  "resource_type:DataStructure,": 38,
  "resource_type:Database": 7,
  "resource_type:DatabaseMigration": 10,
  "resource_type:Deployment": 17,
  "resource_type:Filesystem_File": 22,
  "resource_type:Filesystem_File,": 23,
  "resource_type:Filesystem_Folder,": 66,
  "resource_type:Service": 3,
  "resource_type:User": 21,
  "resource_type:VersionControl": 30,
  "resource_type:Webserver,": 35,
  "type": 72,
  "name": 73,
  "properties": 74,
  "operation": 75,
  "target_resource": 76,
  "context": 77,
  "user_role": 78,
  "admin": 79,
  "path": 80,
  "Create": 81,
  "Filesystem": 82,
  "./": 83,
  "./src": 84,
  "./config": 85,
  "./data": 86,
  "/home/user": 87,
  "./docs": 88,
  "Delete": 89
}